cases/00-tutorials/Plate2D-mhd/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform (0 0 402070.06369426753);//398089.1719745223


boundaryField
{
	frontAndBack{
	
	type            zeroGradient;
	
        


	}
    lowerWall
    {
    
	type            fixedValue;
        value           uniform (0 0 402070.06369426753);//398089.1719745223
        
    }
    atmosphere
    {
    
	type            fixedValue;
        value           uniform (0 0 402070.06369426753);//398089.1719745223
        
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
