cases/00-tutorials/Plate2D-mhd/constant/timeVsLaserPosition0
(
    (0    (0 0.005 0))
    (1    (0 0.005 0.6))
)